// প্রাকটিস চ্যালেঞ্জ-১

// প্রতিদিন তোমার কাজ কি?

// ১) রাত ৮ টা বাজে মডিউল আনলক করো

// ২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো

// ৩) ভিডিও দেখতে দেখতে নোটস নাও

// ৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো

// ৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো

// এখন তোমার কাজ হচ্ছে একটা for লুপ ১০ বার চালিয়ে উপরের জিনিসগুলা আউটপুট হিসেবে দেখানো। আবার একই জিনিস while লুপ চালিয়ে ১০ বার দেখানো।

// for loop
// for (let i = 1; i <= 10; i++) {
//     console.log(`try to print - ${i}`)
// }


// while loop
// i = 1
// while (i <= 10) {
//     console.log(`try to print - ${i}`)
//     i++
// }
